---
kind: type
id: T:Autodesk.Revit.DB.DesignOption
source: html/ed121b13-80f0-2bd0-7ebf-f10478e527bf.htm
---
# Autodesk.Revit.DB.DesignOption

An element that represents a design alternative.

## Syntax (C#)
```csharp
public class DesignOption : Element
```

## Remarks
Design options enable the user to add alternative designs within the same project.
 Each element can either be in a design option or not at all, in which case it is considered
 to be part of the main model and have no design alternatives.